---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightType.GetLightDistribution
source: html/8c915d67-4a0c-3a92-36f3-64cdba5f59a5.htm
---
# Autodesk.Revit.DB.Lighting.LightType.GetLightDistribution Method

Return a copy of an object derived from LightDistribution

## Syntax (C#)
```csharp
public LightDistribution GetLightDistribution()
```